---
kind: property
id: P:Autodesk.Revit.DB.MultiReferenceAnnotationOptions.DimensionPlaneNormal
source: html/9015f3a7-dc79-0701-fc8a-364603559f9b.htm
---
# Autodesk.Revit.DB.MultiReferenceAnnotationOptions.DimensionPlaneNormal Property

The normal vector to the dimension plane.

## Syntax (C#)
```csharp
public XYZ DimensionPlaneNormal { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: dimensionPlaneNormal is not length 1.0.